{
  "backend/main.mo": "Motoko canister implementing user profiles, menu data, reservations, reviews, and access‑controlled admin operations.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend source files in the project.",
  "frontend/index.css": "Tailwind base styles defining warm OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Main React router setup with all site pages, theme provider, and initial data seeding.",
  "frontend/src/components/admin/MenuCategoryManager.tsx": "Admin UI for listing and adding menu categories through a form dialog and API hooks.",
  "frontend/src/components/admin/MenuItemManager.tsx": "Admin interface to create, edit, and delete menu items with category selection and item details.",
  "frontend/src/components/AdminGuard.tsx": "Wrapper that checks authentication, profile setup, and admin status before rendering admin content.",
  "frontend/src/components/GalleryLightbox.tsx": "Modal image lightbox with keyboard navigation and previous/next controls.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button handling auth state and query cache clearing.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal form that collects and saves a user's name, email, and phone number using a profile-save hook.",
  "frontend/src/components/RatingStars.tsx": "Displays a row of star icons representing a rating up to a configurable maximum.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with branding, navigation links, contact info, hours, and a credits section.",
  "frontend/src/components/SiteHeader.tsx": "Provides the site header with logo, desktop navigation, and a mobile slide-out menu.",
  "frontend/src/components/SiteLayout.tsx": "Wraps the page with a header, footer, and main content outlet.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides React Query hooks for managing user profiles, admin checks, and CRUD operations on menu categories and items via the actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider enabling login, logout, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Contains read‑only React Query hooks for fetching menu categories, menu items, special items, and reviews from the actor API.",
  "frontend/src/hooks/useReservations.ts": "Defines a mutation hook to create reservations by converting date values and sending them to the actor API.",
  "frontend/src/hooks/useSeedInitialData.ts": "Runs initial seeding once when an actor and identity are available, calling the backend's seedInitialData method.",
  "frontend/src/index.css": "Configures Tailwind CSS with custom color variables and global styles for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders an informational page describing the restaurant's story, values, and highlights using styled components.",
  "frontend/src/pages/AdminPage.tsx": "Displays the admin dashboard with tabs for managing menu items and categories, protected by an admin guard.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact information including address, phone, and opening hours using card-based layout.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a grid of gallery images and opens a lightbox when an image is clicked.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, signature dishes loaded from queries, and featured reviews.",
  "frontend/src/pages/MenuPage.tsx": "Shows menu categories in tabs and loads items per category with loading states and vegetarian indicators.",
  "frontend/src/pages/ReservationPage.tsx": "Provides a reservation form with validation, date/time inputs, and submission via a mutation hook.",
  "frontend/src/utils/format.ts": "Formats a bigint price in paise into a rupee string.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session-stored parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme colors, animations, plugins, and container settings.",
  "project_state.json": "Describes the project’s state and requirements for building a multi-page Indian restaurant website with images, features, and admin menu management. Includes feature definitions, image needs, and architectural notes."
}